# SQL DateTime functions

In this exercise, we will use DateTime functions to aggregate and filter date and time data in order to extract relevant information.

First, let's load our sample database:

In [ ]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

In [ ]:
# Load the Chinook database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///chinook.db

Here is a [view](https://www.lucidchart.com/pages/er-diagrams) of all of our tables in the database:

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://github.com/Explore-AI/Pictures/blob/master/sqlite-sample-database-color.jpg?raw=true"  style="width:70%";/>
<br>
<br>
    <em>Figure 1: Chinook ERD</em>
</div>

[Image source](https://www.sqlitetutorial.net/sqlite-sample-database/)

## Exercise

Run the necessary queries that will provide us with the following information. Compare your queries with the solutions at the end of this notebook.

### Exercise 1

Run a query that will give us a view of the data type of the employees table.

### Exercise 2


We write a query that shows the age of all employees when they were hired.

Return data in the `FirstName` and `LastName` columns and create an `Age when hired` alias for the age from the employees table.

### Exercise 3

In the context of DateTime SQL objects, the `substr()` function allows us to trim or extract certain information within the date or time. We use it by specifying the string and the indices from which to show data, i.e.
`substr(datetime_column,start_index, end_index)`

Write a query that calculates the month-to-month revenue at Chinook. 

Return the month and revenue and use aliases to name the calculated columns appropriately.

### Exercise 4

Write a query that calculates the year-to-year revenue at Chinook.

### Exercise 5

Write a query that returns employees who were hired after 2002-08-14 and before 2003-10-17.

## Solutions

### Exercise 1

In [ ]:
%%sql

PRAGMA table_info(employees);

### Exercise 2

In [ ]:
%%sql

SELECT 
    FirstName, 
    LastName, 
    HireDate - BirthDate AS "Age when hired"
FROM 
    employees
ORDER BY 3;

The "Age when hired" column contains INTERVAL type data, i.e. in years in this case. In other words, we subtracted two dates to obtain an interval value.

### Exercise 3

In [ ]:
%%sql

SELECT 
    SUBSTR(InvoiceDate,1,7) AS "Month", 
    SUM(Total) AS "Revenue"
FROM 
    invoices
GROUP BY 1
ORDER BY 1
LIMIT 10;

### Exercise 4

In [ ]:
%%sql

SELECT 
    SUBSTR(InvoiceDate,1,4) AS "Year", 
    ROUND(SUM(Total),2) AS "Revenue"
FROM invoices
GROUP BY 1
ORDER BY 1;

### Exercise 5

In [ ]:
%%sql 

SELECT 
    *
FROM 
    employees
WHERE 
    HireDate between '2002-08-14' AND '2003-10-17';

We can achieve the same result using standard comparison operators such as <, >, and =.

In [ ]:
%%sql 

SELECT 
      *
FROM 
      employees
WHERE 
      HireDate > '2002-08-14' AND
      HireDate < '2003-10-17';